// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// (читается слева направо и справа налево одинаково)

// Console.Write("Введите пятизначное число: ");
// int a = int.Parse(Console.ReadLine()!);

// for(a.ToString[0], a =[-1]; a<a.Length;a++,a.Length--)
// {
//     if(a!=aLength)
//     {
//         Console.WriteLine("Не является палиндромом");
//     }
//     else
//     {
//         Console.WriteLine("Является палиндромом");  
//     }
// }



//     class Palindr
//      {
//         public static bool Palindromtest (string s)
//         {
//                for (int i = 0, j = s.Length - 1; i < j; i++, j--)
 
//                     if (s[i] != s[j])
//                         return false;
//                        return true;
 
//         }
     
//     static void Main()
//         {
//         string s;
//             Console.WriteLine("Анализ палиндромов\n\nВведите строку:");
//           s = Console.ReadLine();
//            if (Palindromtest(s))
//        Console.WriteLine("Эта строка - палиндром");
//        else Console.WriteLine("Эта строка - не палиндром");
//     Console.ReadLine();
//         }
// }